<template>
  <section class="order_agree">
    <br/>
    <h3 class="title">{{mallName}} 이용을 위하여 아래에 동의해 주세요.</h3>
    <br/>
    <div class="oa_all title_style2">
      <h3 class="check_style1">
        <input type="checkbox" id="agreeAll" v-model="checkALL">
        <label for="agreeAll">
          <span></span>아래의 내용에 모두 동의합니다
        </label>
      </h3>
    </div>
    <ul class="oa_box">
      <li class="is_open">
        <div class="oa_check">
          <div class="check_style1">
            <input type="checkbox" id="shopChecked" v-model="shopChecked">
            <label for="shopChecked">
              <span></span>{{mallName}} 약관 동의</label>
          </div>
        </div>
        <div class="oa_con">
          <pre><strong>제1조 목적</strong>

이 약관은 엔에이치엔(주)(이하 '회사'라 합니다)가 제공하는 페이코플러스숍몰 서비스의 이용과 관련하여 회사와 이용자 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 그 목적으로 합니다.

<strong>제2조 용어의 정의</strong>

1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
<span class="sublst">1) ‘페이코플러스숍몰 서비스’(이하 ‘서비스’라 합니다)라 함은 이용자가 모바일 웹사이트 등을 통해 재화 또는 용역(이하 ‘상품’이라 합니다)을 거래할 수 있도록 회사가 제공하는 가상의 영업장 및 전자상거래 관련 서비스를 의미합니다.
2) ‘이용자’라 함은 서비스에 접속하여 이 약관에 따라 회사가 제공하는 서비스를 이용하는 회원 및 비회원을 의미 합니다.
3) ‘회원‘이라 함은 PAYCO 회원으로서, 이 약관에 따른 회원가입 절차를 완료하여 회사로부터 서비스 이용 자격을 부여 받은 자를 의미합니다.
4) ‘비회원’이라 함은 회원가입 절차 없이 이 약관에 따라 회사가 제공하는 서비스를 이용하는 자를 의미합니다.
5) ‘PAYCO 회원’이라 함은 엔에이치엔페이코(주)의 PAYCO회원약관에 동의하고 이용신청을 하여 엔에이치엔페이코㈜로부터 승낙 받은 자를 의미합니다.
6) ‘제휴사’란 서비스를 이용하여 실제로 상품을 판매하는 자를 말하며, 또한 서비스에서 접속 가능한 온라인 상점을 제공하는 자를 의미합니다.</span>
2. 이 약관에서 사용하는 용어 중 본 조에서 정하지 아니한 것은 서비스 내 안내페이지 및 PAYCO 회원약관, PAYCO 서비스 이용약관, 관계 법령 또는 상관례에서 정하는 바에 따릅니다.


<strong>제3조 약관의 명시와 개정</strong>

1. 회사는 이 약관의 내용을 이용자가 쉽게 알 수 있도록 서비스 화면 내 또는 링크로 연결된 화면에 게시합니다.
2. 회사는 “약관의 규제에 관한 법률”, “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 관계 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. 회사가 이 약관을 개정 할 경우에는 적용일자 및 적용내용, 개정 사유를 명시하며 그 적용일자로부터 최소한 7일 이전(이용자에게 불리하거나 중대한 사항의 변경은 30일 이전)부터 일정기간 공지하고, 기존 이용자에게는 별도의 동의 창, 초기화면 등 전자적 수단을 통해 고지 합니다.
4. 회사가 전 항에 따라 개정 약관을 공지 또는 통지 하면서 이용자에게 적용일 전까지 동의 또는 거부의 의사표시를 하지 않으면 변경에 동의 한 것으로 본다는 뜻을 명확하게 공지 또는 통지 하였음에도 이용자가 명시적으로 거부의 의사표시를 하지 아니한 경우, 이용자가 개정 약관에 동의한 것으로 봅니다.
5. 이용자가 개정약관에 동의하지 않으면 회사는 해당 이용자에 대해 개정 약관의 내용을 적용 할 수 없으며 이 경우 이용자는 회원 탈퇴를 통해 이용계약을 해지 할 수 있습니다. 이용자가 약관 개정에 동의를 하지 않을 경우 회사는 해당 이용자에게 개정된 약관에 따른 서비스를 제한 할 수 있습니다.
6. 이 약관에서 정하지 아니한 사항이나 해석에 대해서는 별도의 회사 정책, PAYCO 회원 약관, PAYCO 서비스 이용약관, 관계 법령 또는 상관례에 의합니다.


<strong>제4조 서비스의 제공 및 변경 등</strong>

1. 회사는 이용자에게 아래와 같은 서비스를 제공합니다.<span class="sublst">1) 쇼핑 서비스<span class="sublst">- 상품에 대한 정보 제공 및 이용자와 제휴사간 구매계약의 중개, 이용자와 회사간 구매계약의 체결
- 이용자와 회사간 구매계약이 체결된 상품의 배송</span>2) 기타 회사가 제공하는 서비스
</span>
2. 회사는 이용자와 제휴사 간 거래의 안정성 및 신뢰성을 증진시키는 도구만을 제공하며, 이용자와 제휴사 간 성립된 거래와 관련된 책임은 거래당사자들 스스로가 부담해야 합니다. 단, 회사와 이용자간 성립된 거래와 관련된 책임은 회사가 거래당사자로서 부담합니다.
3. 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 제12조에 정한 방법으로 사전에 이용자에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우에는 사후에 통지할 수 있습니다.
4. 회사는 서비스 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스 화면에 공지한 바에 따릅니다.
5. 회사는 운영상, 경영상, 기술상의 필요에 따라 제공하고 있는 서비스의 전부 또는 일부 내용을 변경하거나 서비스를 종료할 수 있습니다.
6. 서비스의 내용, 이용방법 등에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등을 변경 7일 전에, 서비스를 종료하는 경우에는 30일 전에 서비스 화면에 공지합니다. 다만, 사전에 공지할 수 없는 부득이한 사정이 있는 경우에는 사후에 지체없이 이를 공지할 수 있습니다.
7. 회사는 이 약관 및 관계 법령에 특별한 규정이 없는 한 서비스의 중단, 변경 또는 종료로 인하여 이용자가 입은 손해에 대하여 아무런 책임을 지지 않습니다.


<strong>제5조 대리행위 및 보증의 부인</strong>

1. 회사는 이용자와 제휴사간의 거래에 관하여 통신판매중개자로서 이용자와 제휴사 간의 자유로운 상품의 거래를 위한 시스템을 운영 및 관리, 제공할 뿐이므로 이용자 또는 제휴사를 대리하지 않습니다. 또한, 이용자와 제휴사 간에 성립된 거래와 관련된 책임과 이용자와 제휴사가 제공하고 등록한 정보에 대해서는 해당 이용자와 제휴사가 그에 대한 직접적인 책임을 부담하여야 합니다.
2. 회사는 서비스를 통하여 이루어지는 이용자와 제휴사 간의 거래와 관련하여 판매의사 또는 구매의사의 존부 및 진정성, 등록 상품의 품질, 완전성, 안정성, 적법성 및 타인의 권리에 대한 비침해성, 이용자 또는 제휴사가 입력하는 정보 및 그 정보를 통하여 링크된 URL에 게재된 자료의 진실성 또는 적법성 등 일체를 보증하지 않으며, 이와 관련한 일체의 위험과 책임은 해당 이용자가 전적으로 부담합니다.
3. 회사는 이용자에게 상품을 판매하거나 제휴사로부터 구매하지 않으며, 단지 이용자와 제휴사 간의 거래의 안전성과 신뢰성을 높이는 도구만을 개발하여 제공합니다.
4. 이용자는 상품을 구매하기 전에 반드시 제휴사가 서비스 내에 작성한 상품의 상세 내용과 거래의 조건을 정확하게 확인해야 합니다. 구매하려는 상품의 내용과 거래의 조건을 확인하지 않고 구매하여 발생한 모든 손실과 손해는 이용자 본인이 부담합니다.


<strong>제6조 회원 가입 신청</strong>

1. 회원 가입 신청자는 PAYCO 회원에 가입하고, 이 약관의 내용에 대하여 동의를 한 다음 회사가 정한 절차에 따라 회원정보를 정확히 입력하여 회원가입을 신청하고 회사가 회원가입을 승낙함으로써 회원 가입이 완료됩니다. 다만, 회사는 이러한 신청에 있어 회원 가입 신청자에게 전자우편 인증 등 본인인증을 요청할 수 있습니다.
2. 회사는 전 항에 따른 회원 가입 신청에 대하여 승낙을 할 수 있습니다. 다만, 회사는 다음 각 호의 어느 하나에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 본 이용계약을 해지할 수 있습니다.
<span class="sublst">1) PAYCO 회원이 아닌 자가 신청한 경우
2) 전자우편 인증 등 회사가 요청한 인증 절차를 완료하지 않은 경우
3) 회원 가입 신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단, 회사의 회원 재가입 승낙을 얻은 경우에는 예외로 합니다.
4) 회원 가입 신청에 있어서 회원 정보를 허위로 입력한 경우
5) 회사가 정한 절차에 따라 회사가 제시하는 내용을 기재하지 않은 경우
6) 회원 가입 신청자의 귀책사유로 인하여 승낙이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
7) 기타 이 약관에 위반되거나 위법 또는 부당한 가입 신청임이 확인된 경우 또는 회원 가입 승낙이 부적합하다고 합리적으로 판단되는 경우</span>
3. 회사는 서비스 관련 설비의 여유가 없거나 기술상 또는 업무상 문제가 있는 경우, 기타 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우에는 승낙을 유보할 수 있습니다.
4. 본 조 제2항과 제3항에 따라 회원 가입 신청의 승낙을 하지 아니하거나 유보한 경우 회사는 원칙적으로 이를 회원 가입 신청자에게 알리도록 합니다.
5. 회사는 회원에 대해 회사 정책에 따라 등급별로 구분하여 서비스 이용의 범위, 방법, 횟수 등을 세분화하여 이용에 차등을 둘 수 있습니다.
6. 회원 가입 계약의 성립시기는 회사의 승낙이 회원 가입 신청자에게 도달한 시점으로 합니다.


<strong>제7조 이용자 정보의 제공 및 변경</strong>

1. 이용자는 이 약관에 의하여 회사에 정보를 제공하여야 하는 경우에는 진실된 정보를 제공하여야 하며, 허위정보 제공으로 인해 발생한 불이익에 대해서는 보호받지 못합니다.
2. 회원은 개인정보관리화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 회사는 향후 회원의 동의 하에 개인정보를 추가적으로 수집할 수 있습니다.
3. 이용자는 회원 가입 신청 또는 비회원 구매 신청 시 기재하거나 제공한 사항이 잘못되었거나 변경되었을 경우 온라인으로 수정을 하거나 전자우편 기타 방법으로 즉시 회사에 해당 사항을 알려야 합니다.
4. 회원가입 시 회사에 제공한 정보와 비회원 구매 시 회사에 제공한 정보들은 그 관리 책임이 이용자에게 있습니다. 회사에 제공한 정보가 잘못되었거나 변경되었음에도 해당 사항을 수정하지 않거나 해당 사항을 회사에 알리지 않아 발생한 각종 손해와 잘못된 수정으로 인하여 발생한 손해는 당해 회원이 부담하여야 하며, 회사는 이에 대하여 아무런 책임을 지지 않습니다.


<strong>제8조 이용자의 아이디 및 비밀번호의 관리에 대한 의무</strong>

1. 회원의 아이디(ID)와 비밀번호, 비회원 구매 시 주문 비밀번호에 관한 관리책임은 전적으로 이용자에게 있으며, 이를 제3자가 이용하도록 하여서는 아니 되며, 회사의 귀책사유 없는 아이디(ID) 또는 비밀번호, 주문 비밀번호의 유출, 제3자의 이용으로 인한 손실이나 손해에 대하여 회사는 아무런 책임을 지지 않습니다.
2. 회사는 이용자의 아이디(ID)가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 회사 및 회사의 운영자로 오인할 우려가 있는 경우에는 해당 아이디(ID)의 이용을 제한할 수 있습니다.
3. 이용자는 아이디(ID) 및 비밀번호, 주문 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 회사에 통지하여야 하고, 회사의 안내가 있는 경우에는 그에 따라야 합니다.
4. 본 조 제(3)항의 경우에 해당 이용자가 회사에 그 사실을 지체 없이 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 아무런 책임을 지지 않습니다.


<strong>제9조 개인정보의 보호 및 관리</strong>

1. 회사는 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 관계 법령이 정하는 바에 따라 이용자의 개인정보를 보호하기 위해 노력합니다. 이용자 개인정보의 보호 및 사용에 대해서는 관계 법령 및 회사의 개인정보처리방침이 적용됩니다.
2. 회사의 서비스 이외의 단순히 링크된 제3자의 사이트에서는 회사의 개인정보처리방침이 적용되지 않습니다. 링크된 사이트 및 상품을 제공하는 제3자의 개인정보 처리와 관련하여서는 해당 사이트 및 제3자의 개인정보처리방침을 확인할 책임은 이용자에게 있으며, 회사는 이에 대하여 책임을 부담하지 않습니다.
3. 회사는 이용자의 귀책사유로 인하여 노출된 이용자의 계정정보를 포함한 모든 정보에 대해서 일체의 책임을 지지 않습니다.
4. 회사가 제공하는 서비스를 통하여 주문 및 결제가 이루어진 경우 거래 당사자 간 원활한 의사소통 및 배송, 상담 등 거래 이행을 위하여 관련된 정보를 관계 법령을 준수하는 범위에서 거래 당사자에게 제공할 수 있습니다.


<strong>제10조 회원 탈퇴 등</strong>

1. 회원은 회사에 언제든지 탈퇴를 요청할 수 있으며, 회사는 관계 법령 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다. 다만, 회사는 회원의 회원가입 후 일정시간 동안 서비스 부정이용 방지 등의 사유로 즉시 탈퇴를 제한할 수 있습니다.
2. 회원은 탈퇴를 요청하기 전에 현재 진행 중인 모든 상품의 거래를 완료하거나 철회 또는 취소하여야 하며, 거래의 철회 또는 취소로 인한 불이익은 회원 본인이 부담하여야 합니다.
3. 본 조 제1항에 따라 회원이 회원 탈퇴를 할 경우 회사는 관계 법령에 따라 회원정보를 보유해야 하는 경우를 제외하고는 즉시 회원의 개인정보를 삭제 합니다.
4. 회원의 회원탈퇴, 자격 상실 등으로 본 약관의 적용이 종료되는 경우 회사가 회원에게 제공하였던 쿠폰, 할인 등의 혜택은 모두 자동소멸되고, 재가입시에도 이는 복원되지 않습니다.


<strong>제11조 이용제한 등</strong>

1. 이용자가 다음 각 호의 어느 하나에 해당하는 경우, 회사는 회원자격을 제한, 정지시키거나 이용계약을 해지할 수 있습니다.
<span class="sublst">1) 이 약관의 의무를 위배하거나 서비스의 정상적인 운영을 방해한 경우
2) 가입 신청 시에 허위 내용을 등록한 경우
3) 서비스를 이용하여 구입한 상품의 대금, 기타 서비스 이용과 관련하여 이용자가 부담하는 채무를 기일에 지급하지 않는 경우
4) 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
5) 서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
6) 기타 회사가 합리적인 판단에 따라 서비스의 제공을 거부할 필요가 있다고 인정하는 경우</span>
2. 회사가 이용계약을 해지하는 경우, 해지사유와 해지일을 제12조에 따라 이용자에게 통지합니다.
3. 회사의 이용제한, 해지에 정당한 사유가 있는 경우에 회사는 이용제한, 해지로 인하여 이용자가 입은 손해를 배상하지 않습니다.
4. 회사는 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 및 동법 시행령에 따라 1년간 서비스를 이용하지 않는 회원의 개인정보를 보호하기 위해 개인정보 파기 등 필요한 조치를 취합니다. 또한, 회사는 객관적으로 계정정보 도용 피해가 우려되는 경우에는 회원정보의 보호 및 운영의 효율성을 위해 임시조치, 이용제한, 계정정보 삭제 등 필요한 조치를 취할 수 있습니다. 본 항에 따른 조치가 취해지는 경우, 회사는 조치일 30일 전까지 개인정보 파기 등 필요한 조치가 취해진다는 사실, 일시 및 항목을 명시하여 제12조에 따라 통지합니다.
5. 본 조에 따라 이용계약이 해지되는 경우 회원의 개인정보에 관하여 회사는 제10조 제(3)항에 따라 처리합니다.
6. 회원은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차에 따라 이의신청을 할 수 있으며, 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.


<strong>제12조 이용자에 대한 통지</strong>

1. 회사는 불특정다수 이용자에 대한 통지의 경우 1주일 이상 서비스 화면에 게시함으로써 개별통지에 갈음할 수 있습니다.
2. 회사가 특정 이용자 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 통지를 하는 경우, 회원가입 시 회사와 미리 약정하여 지정한 전자우편 등으로 개별 통지합니다.


<strong>제13조 회사의 의무</strong>

1. 회사는 관계 법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
2. 회사는 이용자가 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다.
3. 회사는 서비스 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우편 등을 통하여 회원에게 처리과정 및 결과를 전달합니다.
4. 회사는 계속적이고 안정적인 서비스의 제공을 위하여 서비스 개선을 하던 중 설비에 장애가 생기거나 데이터 등이 멸실된 때에는 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 결함 및 장애 등 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다


<strong>제14조 이용자의 의무</strong>

1. 이용자는 다음 각 호의 어느 하나에 해당하는 행위를 하여서는 안됩니다.
<span class="sublst">1) 신청 또는 변경 시 허위내용의 등록
2) 타인의 정보도용
3) 회사의 임직원, 운영자, 기타 관계자를 사칭하는 행위
4) 회사가 게시한 정보를 변경하는 행위
5) 회사가 금지한 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시 행위
6) 회사가 제공 또는 승인하지 않은 컴퓨터 프로그램이나 기기 또는 장치를 제작, 배포, 이용, 광고하는 행위
7) 회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해 행위
8) 회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
9) 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 회사에 공개 또는 게시하는 행위
10) 회사의 동의 없이 영리, 영업, 광고, 정치활동 등을 목적으로 서비스를 이용하는 행위
11) 기타 관계 법령에서 금지하거나 선량한 풍속 기타 사회통념상 허용되지 않거나 부당한 행위</span>
2. 이용자는 관계 법령, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 회사가 통지하는 사항 등을 확인하고 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 안 됩니다.


<strong>제15조 이용자의 서비스 이용</strong>

1. 이용자는 스스로 책임지고 상품을 구매하여야 하고, 상품을 구매하기 전에 반드시 회사 또는 제휴사가 서비스 내에 작성한 상품의 상세 내용과 거래의 조건을 정확하게 확인해야 합니다. 구매하려는 상품의 내용과 거래의 조건을 확인하지 않고 구매하여 발생한 모든 손실과 손해는 이용자 본인이 부담합니다.
2. 이용자는 구매의사 없이 회사 또는 제휴사의 판매상품에 구매의사를 표시하여서는 아니 되고, 회사 또는 제휴사의 상품판매기회를 방해하거나 다른 이용자의 구매기회를 방해하여서는 안 됩니다.
3. 이용자의 구매 신청 내용에 허위, 누락, 오기가 있는 경우 혹은 미성년자가 담배, 주류 등 청소년보호법에서 금지하는 상품을 구매하는 것과 같이 이용자가 관련 법률에 위반되는 구매신청을 하는 경우, 회사는 해당 구매신청을 승낙하지 아니하거나 이를 사후에 알게 되는 경우 구매신청을 취소할 수 있습니다.
4. 이용자는 이 약관 및 회사가 서비스 화면에서 공지하는 내용을 준수하여야 하고, 이 약관 및 공지 내용을 위반하거나 이행하지 않아서 발생하는 모든 손실과 손해에 대하여 책임을 집니다.
5. 이용자는 구매한 상품에 청약철회의 원인이 발생하면 수령한 상품을 임의로 사용하거나 훼손되도록 방치해서는 아니 되고, 청약철회 상품의 임의사용이나 상품보관의 미흡으로 상품이 훼손되었을 때에는 그에 합당한 비용을 부담하여야 합니다.
6. 이용자는 회사 또는 제휴사와의 상품매매 절차에서 분쟁이 발생하면 분쟁의 해결을 위하여 성실히 임해야 하며, 분쟁해결의 불성실로 회사 또는 제휴사에 손실이나 손해가 발생하면 그에 대한 모든 책임을 부담하여야 합니다.
7. 이용자는 엔에이치엔페이코㈜가 제공하는 PAYCO 결제시스템을 이용하여 구매할 수 있습니다. 이용자가 상품을 구매할 경우에는 본인 명의의 결제수단을 사용하여야 하고, 타인의 결제수단을 임의로 사용하여서는 아니 되며, 타인의 결제수단을 임의로 사용하여 회사, 제휴사 및 해당 결제수단 소유자에게 발생하는 손실 또는 손해 등에 대한 모든 책임은 이용자가 부담합니다.
8. 매매대금의 결제와 관련하여 이용자가 입력한 정보 및 그 정보와 관련하여 발생하는 책임과 불이익은 전적으로 이용자가 부담합니다.
9. 회사는 이용자가 상품을 주문한 후 24시간 이내에 매매대금을 결제하지 아니하는 경우에는 해당 주문을 취소한 것으로 간주하여 이를 자동으로 취소할 수 있습니다.
10. 회사는 이용자의 매매대금 결제 시 해당 결제수단에 대하여 정당한 사용권한이 있는지 확인할 수 있고, 이에 대한 확인이 완료될 때까지 해당 거래의 진행을 중지하거나 해당 거래를 취소할 수 있습니다.
11. 회사는 이용자에게 서비스가 안전하게 제공될 수 있도록 각종 설비와 자료를 관리해야 하며, 서비스가 제공 목적에 맞게 이용되고 있는지 확인하고, 이용 목적에 위반되는 부분이 있는 것으로 확인되면 사유의 소명을 요청할 수 있습니다.
12. 회사가 이용자의 서비스의 이용 편의를 높이기 위해 제휴사 등으로부터 상품 관련 정보를 제공받아 게재하거나 제3자가 제공하는 방식으로 서비스를 통하여 참조용 상품정보나 관련 콘텐츠를 제공하는 경우에도 이용자는 상품 구매와 관련하여 자신의 판단과 책임으로 결정하여야 하고, 회사는 어떠한 경우에도 이용자의 구매 결정에 대하여 책임을 지지 않습니다.
13. 회사는 회사가 판매하는 상품이 품절 등의 사유로 이용자에게 제공이 불가한 경우, 이와 같은 사실을 현재의 상품 정보를 게시한 곳에 즉시 공지하고, 회사가 제공하기로 이용자와 계약을 체결한 상품에 관하여 품절 등의 사유가 발생한 경우 이를 이용자에게 즉시 통지합니다.
14. 이용자는 제6조에 따른 회원 가입 없이 서비스를 이용할 수 있고 비회원 구매가 가능하지만, 회원 전용 서비스와 혜택(쿠폰, 할인 등)은 비회원 구매 시 적용되지 않을 수 있습니다.
15. 특정 상품(회원 혜택을 위한 특가 상품, 성인용 상품 등)은 제6조에 따른 회원 가입이 필요하며, 회원 가입 절차 없이 해당 상품의 구매는 불가능 합니다.


<strong>제16조 결제대금 예치서비스의 이용</strong>

1. 회사는 서비스에서 제공하는 전자상거래 서비스의 신뢰성을 제고하고 안전한 거래가 이루어질 수 있도록 결제대금 예치서비스를 제공합니다.
2. 결제대금 예치서비스를 이용하는 이용자는 상품의 배송 완료 시 회사에 구매확정, 교환 또는 반품의 의사표시를 하여야 합니다.
3. 배송완료가 되었음에도 구매확정기간 내에 이용자로부터 교환 또는 반품의 의사표시가 없는 경우 회사는 구매확정의 의사가 있는 것으로 간주하여 익영업일에 자동구매확정처리를 할 수 있습니다.
4. 회사는 이용자의 구매확정의 의사가 있거나 구매확정의 의사가 있다고 간주되는 경우 “전자상거래 등에서의 소비자보호에 관한 법률”의 관련 규정에 따라 대금을 상품의 제휴사에게 지급하거나 회사가 이를 취득할 수 있습니다.
5. 구매가 확정되고 제휴사에게 정산이 완료된 시점에 결제대금 예치서비스가 종료되며, 이후 청약철회, 취소, 해제, 무효 등의 사유가 발생하는 경우 이용자는 제휴사와 직접 청약철회, 취소, 해제 및 결제대금 환불 등에 관한 절차를 진행함을 원칙으로 합니다. 단, 회사가 직접 이용자에게 판매한 상품에 관하여는 회사가 위 절차를 진행합니다.
6. 회사의 결제대금 예치서비스는 제휴사 또는 이용자를 대리하는 것이 아니며, 상품의 구매와 관련하여 제휴사의 의무나 회원의 의무를 대행하는 것이 아닙니다. 단, 회사가 직접 이용자에게 판매한 상품에 관하여는 그러하지 않습니다.


<strong>제17조 배송</strong>

1. 이용자가 서비스를 이용하여 상품을 주문하면서 입력한 배송 관련 정보는 회원의 동의를 받아 제휴사에게 제공됩니다.
2. 배송과 관련하여 제휴사와 이용자, 배송업체, 금융기관 등과의 사이에 분쟁 등이 발생한 경우에는 해당 당사자 간에 해결을 원칙으로 하고, 회사는 이에 대하여 관여하지 않으며 어떠한 책임도 부담하지 않습니다. 단, 회사가 직접 이용자에게 판매한 상품에 관하여는 회사가 책임을 부담합니다.
3. 회사가 이용자에게 판매하는 상품에 관하여, 회사는 이용자와 상품의 공급시기에 관하여 별도의 약정이 없는 이상 이용자가 청약을 한 날부터 7일 이내 상품을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다. 다만, 회사가 이미 상품 대금의 전부 또는 일부를 받은 경우에는 대금의 전부 또는 일부를 받은 날부터 3영업일 이내 조치를 취합니다. 이때 회사는 이용자가 상품의 공급 절차 및 진행 상황을 확인할 수 있도록 적절한 조치를 취합니다.


<strong>제18조 취소/반품/환불</strong>

1. 이용자는 구매한 상품이 발송되기 전까지 구매를 취소할 수 있으며, 배송중인 경우에는 취소가 아닌 반품절차에 따라 처리됩니다.
2. 이용자가 결제를 완료한 후 배송대기, 배송요청 상태에서는 취소 신청 접수 시 특별한 사정이 없는 한 즉시 취소처리가 완료됩니다.
3. 이용자는 “전자상거래 등에서의 소비자보호에 관한 법률”에 따라 상품을 배송받은 날로부터 7일 이내에 반품을 요청할 수 있습니다. 다만, 다음 각 호의 어느 하나에 해당하는 경우에는 반품을 요청할 수 없습니다.
<span class="sublst">1)	이용자에게 책임이 있는 사유로 상품이 멸실 또는 훼손된 경우 (다만, 상품의 내용을 확인하기 위하여 포장 등을 훼손한 경우에는 반품이나 교환을 요청할 수 있습니다.)
2) 이용자의 사용 또는 일부 소비에 의하여 상품의 가치가 현저히 감소한 경우
3) 시간의 경과에 의하여 재판매가 곤란할 정도로 상품의 가치가 현저히 감소한 경우
4) 복제가 가능한 경우 상품의 포장을 훼손한 경우
5) 기타 이용자가 반품이나 교환을 요청할 수 없는 합리적인 사유가 있는 경우</span>
4. 이용자는 제3항에도 불구하고 상품의 내용이 표시, 광고 내용과 다르거나 계약 내용과 다르게 이행된 때에는 당해 상품을 공급받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내 반품을 요청할 수 있습니다.
5. 회사는 이용자로부터 반품의 의사표시를 접수하면, 즉시 그러한 사실을 제휴사에게 통보합니다.
6. 왕복 배송비 등 일반적으로 반품에 필요한 비용은 귀책사유가 있는 쪽에서 부담합니다. 즉, 이용자의 단순변심인 경우에는 이용자가 반품의 비용을 부담하며, 상품의 하자로 인한 반품의 경우는 회사 또는 제휴사가 해당 비용을 부담합니다. 이 경우 반품에 소요되는 비용을 이용자가 부담하여야 하는 경우 반품에 소요되는 비용의 추가 결제가 이루어지지 않으면 환불이 지연될 수 있습니다.
7. 이용자의 반품의 요청이 정당하지 않은 경우, 반품이 접수된 날로부터 14일이 지날 때까지 이용자가 이미 수령한 상품을 회사 또는 제휴사에게 반환하지 않거나 전화, 전자우편 등으로 연락되지 않아 반품의 의사를 철회한 것으로 간주되는 경우 상품의 결제대금은 회사가 취득하거나 제휴사에게 지급될 수 있습니다.
8. 회사 또는 제휴사는 이용자가 구매를 신청한 상품이 품절 등의 사유로 인도 또는 용역의 제공을 할 수 없거나 공급하기 곤란함을 알았을 때에는 지체 없이 그 사유를 이용자에게 통지합니다. 이 경우 사전에 상품의 대금을 받은 경우에는 대금을 받은 날로부터 회사 영업일 기준 3일 이내에 환불에 필요한 조치를 취합니다.
9. 취소처리에 따른 환불은 취소절차가 완료된 날부터 3영업일 이내에 대금의 결제와 동일한 방법으로 이루어지고, 반품처리에 따른 환불은 회사 또는 제휴사가 상품을 이상 없이 반환 받은 날로부터 3영업일 이내에 대금의 결제와 동일한 방법으로 이루어집니다. 다만, 동일한 방법으로 환불이 불가한 경우 회사는 사전에 고지한 방법으로 환불 처리할 수 있습니다.


<strong>제19조 정보의 제공 및 광고의 게재</strong>

1. 회사는 서비스 이용 중 필요하다고 인정되는 다양한 정보를 “정보통신망 이용촉진 및 정보보호 등에 관한 법률” 등 관계 법령을 준수하는 범위에서 공지사항, 전자우편 등의 방법으로 회원에게 제공할 수 있습니다. 다만, 회원은 관계 법령에 따라 언제든지 전자우편 등에 대하여 수신 거절을 할 수 있습니다.
2. 회사는 "정보통신망 이용촉진 및 정보보호 등에 관한 법률"등 관계 법령을 준수하는 범위에서 서비스의 운영과 관련하여 서비스 화면, 전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편을 수신한 회원은 수신거절을 회사에 할 수 있습니다.


<strong>제20조 권리의 귀속</strong>

1. 서비스에 대한 저작권 및 지식재산권은 회사에 귀속됩니다.
2. 회사는 서비스와 관련하여 이용자에게 회사가 정한 이용조건에 따라 서비스를 이용할 수 있는 이용권만을 부여하며, 이용자는 이를 양수도, 매매, 담보제공 등의 처분행위를 할 수 없습니다.
3. 이용자는 서비스를 이용함으로서 얻은 정보 중 회사에게 지식재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의해 영리 목적으로 이용하거나 제3자에게 이용하게 해서는 아니됩니다.


<strong>제21조 민원처리 및 분쟁조정</strong>

1. 회사는 이용자와 제휴사 간의 상품 매매에 관여하지 않으며, 이에 대하여 어떠한 책임도 부담하지 않는 것을 원칙으로 합니다. 다만, 회사는 회사가 판매한 상품에 관한 분쟁 및 이용자의 권익보호를 위해 관계 법령과 회사의 정책에 따라 고객상담센터를 운영할 수 있습니다.
2. 회사는 이용자와 제휴사 간 또는 이용자와 제3자 사이의 민원 및 분쟁이 발생할 경우, 제3자의 입장에서 공정하게 민원처리 및 분쟁조정에 임합니다.
3. 회사의 분쟁조정에 대하여 이용자는 신의성실원칙에 따라 성실히 응해야 합니다.


<strong>제22조 회사의 면책</strong>

1. 이용자와 제휴사 간에 이루어지는 상품의 거래와 관련하여 발생하는 상품의 배송, 거래 취소, 반품 및 환불 등의 거래진행은 거래의 당사자인 이용자와 제휴사 각각의 책임 하에 이루어집니다. 회사는 이용자와 제휴사 간의 상품 거래에 관여하지 않으며, 이에 대하여 어떠한 책임도 부담하지 않습니다.
2. 회사는 이용자의 귀책사유로 인한 서비스 이용의 중지, 이용장애 및 계약해지에 대하여는 책임을 지지 않습니다.
3. 이용자가 자신의 개인정보 및 계정정보 등을 타인에게 제공하거나, 이용자의 관리소홀로 유출됨으로써 발생하는 피해에 대해서 회사는 책임을 지지 않습니다.
4. 회사의 서비스 화면에서 링크, 배너 등을 통하여 연결된 제3자와 이용자 간에 이루어진 거래에 회사는 개입하지 않으며, 해당 거래에 대하여 책임을 지지 않습니다.
5. 회사는 서비스 화면에 표시되는 제휴사 또는 제3자가 제공하는 상품 및 정보 등의 정확성, 적시성, 타당성 등에 대하여 보증하지 않으며, 그와 관련하여 어떠한 책임도 부담하지 않습니다.
6. 회사는 전시, 사변, 천재지변, 국가비상사태, 해결이 곤란한 기술적 결함 기타 불가항력적 사유로 서비스를 제공할 수 없는 경우에는 책임이 면제됩니다.
7. 회사는 기간 통신 사업자가 전기통신서비스를 중지하거나 정상적으로 제공하지 아니하여 이용자에게 손해가 발생한 경우에는 책임이 면제됩니다.
8. 회사는 사전에 공지된 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 서비스가 중지되거나 장애가 발생한 경우에 대해서는 책임이 면제됩니다.


<strong>제23조 준거법 및 재판관할</strong>

1. 이 약관과 관련된 사항에 대하여는 대한민국 법률을 준거법으로 합니다.
2. 회사와 이용자 간 발생한 분쟁에 관한 소송은 제소 당시 이용자의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속 관할로 합니다. 다만 제소 당시 이용자의 주소 또는 거소가 분명하지 아니한 경우 관할법원은 민사소송법에 따라 정합니다.


&lt;부칙&gt;

이 약관은 2018년 8월 1일부터 시행됩니다.

			    </pre>
        </div>
      </li>
      <li class="is_open">
        <div class="oa_check">
          <div class="check_style1">
            <input type="checkbox" id="personalChecked" v-model="personalChecked">
            <label for="personalChecked">
              <span></span>개인정보 수집/이용동의</label>
          </div>
        </div>
        <div class="oa_con size_12">
          <pre><strong>1. 수집하는 개인정보의 항목</strong>

페이코플러스숍 쇼핑몰 서비스는 PAYCO 계정을 통해 가입할 수 있으며, PAYCO로부터 아래와 같은 개인정보를 이용자의 동의 아래 제공 받아 이용합니다.
- PAYCO ID(이메일 또는 휴대폰번호), 이름, 생년월일, 성별, 휴대폰번호, 내·외국인정보, 동일인 식별연계정보(CI)

페이코플러스숍 쇼핑몰 서비스 이용과정에서 아래와 같은 정보가 생성되어 수집될 수 있습니다.
- IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 모바일 서비스 이용 시 단말기 정보(단말기 모델, OS 유형), 결제·구매기록

<strong>2. 개인정보의 수집 및 이용목적</strong>

1. 회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.
<span class="sublst">1) 이용자와 약속한 서비스 제공, 서비스 제공에 따른 본인인증, 구매 및 요금결제, 환불 처리, 상품 및 서비스의 배송, CS 대응 및 제반 업무를 위하여 개인정보를 이용합니다.
2)회원 가입 의사의 확인, 연령 확인 및 법정대리인 동의 진행, 이용자 및 법정대리인의 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인, 문의사항 또는 불만처리 등 회원관리를 위하여 개인정보를 이용합니다.
3)법령 및 이용약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지 장을 주는 행위 및 비인가 행위에 대한 방지 및 제재, 계정도용 및 부정거래 방지, 고지사항 전달, 분쟁 조정을 위한 기록보존 등 이용자 보호 및 안전한 서비스 운영을 위하여 개인정보를 이용합니다.
4)인구통계학적 특성에 따른 서비스 제공, 접속 빈도 분석, 기능개선, 서비스 이용에 대한 통계, 서비스 분석 및 통계 에 기반하여 이용자의 상품 구매 및 서비스 이용 성향, 관심, 이용기록 분석 등을 반영한 신규 서비스 제공(개인 맞춤형 상품 추천 서비스 등 포함)등에 개인정보를 이용합니다.
5)이벤트 정보, 광고성 정보 제공 등 이벤트 및 프로모션의 목적 등에 개인정보를 이용할 수 있습니다.</span>

<strong class="hold">3. 개인정보의 보유 및 이용기간</strong>

<strong class="hold">회사는 원칙적으로 이용자의 개인정보를 회원탈퇴 시까지 보관합니다. 단, 회사는 개인정보 도용 등으로 인한 원치 않는 회원탈퇴 등에 대비하기 위하여 회원탈퇴 요청 후 7일 간 개인정보를 보존합니다. 그 외에도 다음의 정보에 대해서는 관련 법령에 의한 정보보존 사유로 회원탈퇴 후에도 해당 기간에 도달할때까지 보존됩니다.

- 서비스 이용에 관한 로그기록
보존 이유 : 통신비밀보호법
보존 기간 : 3개월

- 소비자의 불만 또는 분쟁처리에 관한 기록
보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
보존 기간 : 3년

- 계약 또는 청약철회 등에 관한 기록
보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
보존 기간 : 5년

- 대금결제 및 재화 등의 공급에 관한 기록
보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
보존 기간 : 5년</strong>

  이용자는 개인정보 수집 및 이용 동의를 거부할 권리가 있습니다. 다만 개인정보 수집 및 이용 동의를 거부하실 경우 페이코플러스숍 쇼핑몰 서비스 이용이 제한되거나 불가할 수 있습니다.
			    </pre>
        </div>
      </li>
      <li>
        <div class="oa_check">
          <div class="check_style1">
            <input type="checkbox" id="fourteenOverChecked" v-model="fourteenOverChecked">
            <label for="fourteenOverChecked">
              <span></span>만 14세 이상입니다.</label>
          </div>
        </div>
      </li>
      <li>
        <div class="oa_check">
          <div class="check_style1">
            <input type="checkbox" id="shopAdChecked" v-model="shopAdChecked">
            <label for="shopAdChecked">
              <span></span>쇼핑혜택 알림을 받습니다 (선택)</label>
          </div>
        </div>
      </li>
    </ul>
    <div class="order_buy_btn">
      <a class="btn_style1" @click.prevent="agreement">확인</a>
    </div>
  </section>
</template>

<script>

import { mapState } from 'vuex'
import cookies from 'js-cookie'
import { getDateFormatForAlert } from '@/utils/dateUtils'
import config from '@/config'

export default {
  data () {
    return {
      shopChecked: false,
      shopAdChecked: false,
      personalChecked: false,
      fourteenOverChecked: false,
      running: false,
      mallName: config.mallName
    }
  },
  metaInfo: {
    title: '약관동의'
  },
  computed: {
    checkALL: {
      get () {
        return this.shopChecked && this.shopAdChecked && this.personalChecked && this.fourteenOverChecked
      },
      set (val) {
        this.shopChecked = val
        this.shopAdChecked = val
        this.personalChecked = val
        this.fourteenOverChecked = val
      }
    },
    ...mapState('profile', ['profile'])
  },
  methods: {
    go (nxturl) {
      if (opener) {
        if (!nxturl || nxturl === '' || nxturl === 'undefined') {
          opener.location.href = '/'
        } else {
          opener.location.href = nxturl
        }
        self.close()
      } else {
        if (!nxturl || nxturl === '' || nxturl === 'undefined') {
          location.href = '/'
        } else {
          location.href = nxturl
        }
      }
    },
    agreement () {
      if (this.running) {
        return
      } else {
        this.running = true
      }
      const nxturl = this.$store.state.route.query.nxturl
      if (!this.shopChecked) {
        alert(`${config.mallName} 약관에 동의 해 주세요.`)
        this.running = false
        return false
      }

      if (!this.personalChecked) {
        alert('개인정보 수집 및 이용에 동의 해 주세요.')
        this.running = false
        return false
      }

      if (!this.fourteenOverChecked) {
        alert("'만14세 이상입니다.' 에 동의해주세요. 만 14세 미만인 경우 회원 가입이 불가능합니다.")
        this.running = false
        return false
      }

      const _this = this
      if (this.shopAdChecked) {
        alert(`${config.mallName} 쇼핑혜택 알림에 동의하셨습니다. \r\n ${getDateFormatForAlert()}`)
      }
      this.$store.dispatch('authentication/setShopAgreementY').then(() => {
        this.$store.dispatch('profile/memberFetch').then(() => {
          const status = cookies.get('memberStatus')
          if (status === 'WAITING') {
            _this.$store.dispatch('profile/memberStatusChange', this.shopAdChecked).then(() => {
              if (_this.shopAdChecked) {
                _this.$store.dispatch('profile/updateProfile', { smsAgreed: true, directMailAgreed: true }).then(() => {
                  _this.go(nxturl)
                })
              } else {
                _this.go(nxturl)
              }
            })
          } else {
            if (_this.shopAdChecked) {
              _this.$store.dispatch('profile/updateProfile', { smsAgreed: true, directMailAgreed: true }).then(() => {
                _this.go(nxturl)
              })
            } else {
              _this.go(nxturl)
            }
          }
        })
      })
    }
  }
}
</script>

<style>
.oa_con {
  display: block;
  overflow-x: hidden;
  overflow-y: auto;
  padding: 10px 13px;
  border: 1px solid #e0e0e0;
  background: #f6f6f6;
  color: #666;
  font-size: 11px;
  line-height: 17px;
}
.oa_con pre {
  margin: 0;
  padding: 0;
  font-size: 11px;
  white-space: pre-wrap;
  word-break: break-all;
}
.sublst {
  display: block;
  margin-left: 15px;
}
.hold {
  font-size: 13px;
}
.oa_con.size_12 pre {
  font-size: 12px;
}
</style>
